[Timeout] BlockStatement
src/App.jsx:12:26
   buscarPosicaoDosOnibus,
 } from "./services/sptransAPI";
 
-function temValor(value) {
-  return value !== undefined && value !== null && value !== "";
-}
+function temValor(value) {}
 
 function formatarCodigoLinha(linha) {

[Timeout] EqualityOperator
src/App.jsx:13:33
 } from "./services/sptransAPI";
 
 function temValor(value) {
-  return value !== undefined && value !== null && value !== "";
+  return value !== undefined && value === null && value !== "";
 }
 

[Timeout] ConditionalExpression
src/App.jsx:13:10
 } from "./services/sptransAPI";
 
 function temValor(value) {
-  return value !== undefined && value !== null && value !== "";
+  return false;
 }
 

[Timeout] BlockStatement
src/App.jsx:16:37
   return value !== undefined && value !== null && value !== "";
 }
 
-function formatarCodigoLinha(linha) {
-  const codigoBase = temValor(linha?.lt)
-    ? String(linha.lt)
-    : String(linha?.c ?? linha?.cl ?? "Linha");
-
-  if (codigoBase.includes("-") || !temValor(linha?.tl)) {
-    return codigoBase;
-  }
-
-  return `${codigoBase}-${linha.tl}`;
-}
+function formatarCodigoLinha(linha) {}
 
 function formatarSentidoLinha(linha) {

[Timeout] OptionalChaining
src/App.jsx:17:31
 }
 
 function formatarCodigoLinha(linha) {
-  const codigoBase = temValor(linha?.lt)
+  const codigoBase = temValor(linha.lt)
     ? String(linha.lt)
     : String(linha?.c ?? linha?.cl ?? "Linha");

[Timeout] LogicalOperator
src/App.jsx:19:14
 function formatarCodigoLinha(linha) {
   const codigoBase = temValor(linha?.lt)
     ? String(linha.lt)
-    : String(linha?.c ?? linha?.cl ?? "Linha");
+    : String((linha?.c ?? linha?.cl) && "Linha");
 
   if (codigoBase.includes("-") || !temValor(linha?.tl)) {

[Timeout] OptionalChaining
src/App.jsx:19:26
 function formatarCodigoLinha(linha) {
   const codigoBase = temValor(linha?.lt)
     ? String(linha.lt)
-    : String(linha?.c ?? linha?.cl ?? "Linha");
+    : String(linha?.c ?? linha.cl ?? "Linha");
 
   if (codigoBase.includes("-") || !temValor(linha?.tl)) {

[Timeout] ConditionalExpression
src/App.jsx:21:7
     ? String(linha.lt)
     : String(linha?.c ?? linha?.cl ?? "Linha");
 
-  if (codigoBase.includes("-") || !temValor(linha?.tl)) {
+  if (true) {
     return codigoBase;
   }

[Timeout] LogicalOperator
src/App.jsx:21:7
     ? String(linha.lt)
     : String(linha?.c ?? linha?.cl ?? "Linha");
 
-  if (codigoBase.includes("-") || !temValor(linha?.tl)) {
+  if (codigoBase.includes("-") && !temValor(linha?.tl)) {
     return codigoBase;
   }

[Timeout] BlockStatement
src/App.jsx:28:38
   return `${codigoBase}-${linha.tl}`;
 }
 
-function formatarSentidoLinha(linha) {
-  if (linha?.lc === true) {
-    return "circular";
-  }
-
-  if (!temValor(linha?.sl)) {
-    return "";
-  }
-
-  const sentido = Number(linha.sl);
-
-  if (sentido === 1) {
-    return "ida";
-  }
-
-  if (sentido === 2) {
-    return "volta";
-  }
-
-  return `sentido ${linha.sl}`;
-}
+function formatarSentidoLinha(linha) {}
 
 function formatarTrajetoLinha(linha) {

[Timeout] ConditionalExpression
src/App.jsx:29:7
 }
 
 function formatarSentidoLinha(linha) {
-  if (linha?.lc === true) {
+  if (false) {
     return "circular";
   }

[Timeout] OptionalChaining
src/App.jsx:29:7
 }
 
 function formatarSentidoLinha(linha) {
-  if (linha?.lc === true) {
+  if (linha.lc === true) {
     return "circular";
   }

[Timeout] ConditionalExpression
src/App.jsx:33:7
     return "circular";
   }
 
-  if (!temValor(linha?.sl)) {
+  if (false) {
     return "";
   }

[Timeout] BlockStatement
src/App.jsx:33:29
     return "circular";
   }
 
-  if (!temValor(linha?.sl)) {
-    return "";
-  }
+  if (!temValor(linha?.sl)) {}
 
   const sentido = Number(linha.sl);

[Timeout] ConditionalExpression
src/App.jsx:39:7
 
   const sentido = Number(linha.sl);
 
-  if (sentido === 1) {
+  if (false) {
     return "ida";
   }

[Timeout] EqualityOperator
src/App.jsx:39:7
 
   const sentido = Number(linha.sl);
 
-  if (sentido === 1) {
+  if (sentido !== 1) {
     return "ida";
   }

[Timeout] BlockStatement
src/App.jsx:43:22
     return "ida";
   }
 
-  if (sentido === 2) {
-    return "volta";
-  }
+  if (sentido === 2) {}
 
   return `sentido ${linha.sl}`;

[Timeout] EqualityOperator
src/App.jsx:43:7
     return "ida";
   }
 
-  if (sentido === 2) {
+  if (sentido !== 2) {
     return "volta";
   }

[Timeout] StringLiteral
src/App.jsx:47:10
     return "volta";
   }
 
-  return `sentido ${linha.sl}`;
+  return ``;
 }
 

[Timeout] BlockStatement
src/App.jsx:50:38
   return `sentido ${linha.sl}`;
 }
 
-function formatarTrajetoLinha(linha) {
-  const terminalPrincipal = temValor(linha?.tp)
-    ? linha.tp
-    : "Origem nao informada";
-  const terminalSecundario = temValor(linha?.ts)
-    ? linha.ts
-    : "Destino nao informado";
-  const sentido = Number(linha?.sl);
-
-  if (sentido === 1) {
-    return `${terminalPrincipal} -> ${terminalSecundario}`;
-  }
-
-  if (sentido === 2) {
-    return `${terminalSecundario} -> ${terminalPrincipal}`;
-  }
-
-  return `${terminalPrincipal} <-> ${terminalSecundario}`;
-}
+function formatarTrajetoLinha(linha) {}
 
 function formatarLinhaEncontrada(linha) {

[Timeout] OptionalChaining
src/App.jsx:51:38
 }
 
 function formatarTrajetoLinha(linha) {
-  const terminalPrincipal = temValor(linha?.tp)
+  const terminalPrincipal = temValor(linha.tp)
     ? linha.tp
     : "Origem nao informada";

[Timeout] OptionalChaining
src/App.jsx:54:39
   const terminalPrincipal = temValor(linha?.tp)
     ? linha.tp
     : "Origem nao informada";
-  const terminalSecundario = temValor(linha?.ts)
+  const terminalSecundario = temValor(linha.ts)
     ? linha.ts
     : "Destino nao informado";

[Timeout] StringLiteral
src/App.jsx:56:7
     : "Origem nao informada";
   const terminalSecundario = temValor(linha?.ts)
     ? linha.ts
-    : "Destino nao informado";
+    : "";
   const sentido = Number(linha?.sl);
 

[Timeout] OptionalChaining
src/App.jsx:57:26
   const terminalSecundario = temValor(linha?.ts)
     ? linha.ts
     : "Destino nao informado";
-  const sentido = Number(linha?.sl);
+  const sentido = Number(linha.sl);
 
   if (sentido === 1) {

[Timeout] ConditionalExpression
src/App.jsx:59:7
     : "Destino nao informado";
   const sentido = Number(linha?.sl);
 
-  if (sentido === 1) {
+  if (true) {
     return `${terminalPrincipal} -> ${terminalSecundario}`;
   }

[Timeout] BlockStatement
src/App.jsx:59:22
     : "Destino nao informado";
   const sentido = Number(linha?.sl);
 
-  if (sentido === 1) {
-    return `${terminalPrincipal} -> ${terminalSecundario}`;
-  }
+  if (sentido === 1) {}
 
   if (sentido === 2) {

[Timeout] ConditionalExpression
src/App.jsx:63:7
     return `${terminalPrincipal} -> ${terminalSecundario}`;
   }
 
-  if (sentido === 2) {
+  if (true) {
     return `${terminalSecundario} -> ${terminalPrincipal}`;
   }

[Timeout] BlockStatement
src/App.jsx:70:41
   return `${terminalPrincipal} <-> ${terminalSecundario}`;
 }
 
-function formatarLinhaEncontrada(linha) {
-  return [
-    formatarCodigoLinha(linha),
-    formatarSentidoLinha(linha),
-    formatarTrajetoLinha(linha),
-    temValor(linha?.cl) ? `cl ${linha.cl}` : "",
-  ]
-    .filter(Boolean)
-    .join(" | ");
-}
+function formatarLinhaEncontrada(linha) {}
 
 function App() {

[Timeout] MethodExpression
src/App.jsx:71:10
 }
 
 function formatarLinhaEncontrada(linha) {
-  return [
-    formatarCodigoLinha(linha),
-    formatarSentidoLinha(linha),
-    formatarTrajetoLinha(linha),
-    temValor(linha?.cl) ? `cl ${linha.cl}` : "",
-  ]
-    .filter(Boolean)
+  return [formatarCodigoLinha(linha), formatarSentidoLinha(linha), formatarTrajetoLinha(linha), temValor(linha?.cl) ? `cl ${linha.cl}` : ""]
     .join(" | ");
 }

[Timeout] OptionalChaining
src/App.jsx:75:14
     formatarCodigoLinha(linha),
     formatarSentidoLinha(linha),
     formatarTrajetoLinha(linha),
-    temValor(linha?.cl) ? `cl ${linha.cl}` : "",
+    temValor(linha.cl) ? `cl ${linha.cl}` : "",
   ]
     .filter(Boolean)

[Timeout] ArrayDeclaration
src/App.jsx:83:40
 
 function App() {
   const [termo, setTermo] = useState("");
-  const [linhas, setLinhas] = useState([]);
+  const [linhas, setLinhas] = useState(["Stryker was here"]);
   const [linhaSelecionada, setLinhaSelecionada] = useState(null);
   const [paradas, setParadas] = useState([]);

[Timeout] ArrayDeclaration
src/App.jsx:85:42
   const [termo, setTermo] = useState("");
   const [linhas, setLinhas] = useState([]);
   const [linhaSelecionada, setLinhaSelecionada] = useState(null);
-  const [paradas, setParadas] = useState([]);
+  const [paradas, setParadas] = useState(["Stryker was here"]);
   const [onibus, setOnibus] = useState([]);
   const [buscandoLinhas, setBuscandoLinhas] = useState(false);

[Timeout] BooleanLiteral
src/App.jsx:87:56
   const [linhaSelecionada, setLinhaSelecionada] = useState(null);
   const [paradas, setParadas] = useState([]);
   const [onibus, setOnibus] = useState([]);
-  const [buscandoLinhas, setBuscandoLinhas] = useState(false);
+  const [buscandoLinhas, setBuscandoLinhas] = useState(true);
   const [carregandoMapa, setCarregandoMapa] = useState(false);
   const [historicoBuscas, setHistoricoBuscas] = useState([]);

[Timeout] BooleanLiteral
src/App.jsx:88:56
   const [paradas, setParadas] = useState([]);
   const [onibus, setOnibus] = useState([]);
   const [buscandoLinhas, setBuscandoLinhas] = useState(false);
-  const [carregandoMapa, setCarregandoMapa] = useState(false);
+  const [carregandoMapa, setCarregandoMapa] = useState(true);
   const [historicoBuscas, setHistoricoBuscas] = useState([]);
   const [autoAtualizar, setAutoAtualizar] = useState(true);

[Timeout] ArrayDeclaration
src/App.jsx:89:58
   const [onibus, setOnibus] = useState([]);
   const [buscandoLinhas, setBuscandoLinhas] = useState(false);
   const [carregandoMapa, setCarregandoMapa] = useState(false);
-  const [historicoBuscas, setHistoricoBuscas] = useState([]);
+  const [historicoBuscas, setHistoricoBuscas] = useState(["Stryker was here"]);
   const [autoAtualizar, setAutoAtualizar] = useState(true);
   const [ultimaAtualizacao, setUltimaAtualizacao] = useState(null);

[Timeout] BooleanLiteral
src/App.jsx:90:54
   const [buscandoLinhas, setBuscandoLinhas] = useState(false);
   const [carregandoMapa, setCarregandoMapa] = useState(false);
   const [historicoBuscas, setHistoricoBuscas] = useState([]);
-  const [autoAtualizar, setAutoAtualizar] = useState(true);
+  const [autoAtualizar, setAutoAtualizar] = useState(false);
   const [ultimaAtualizacao, setUltimaAtualizacao] = useState(null);
   const [buscaRealizada, setBuscaRealizada] = useState(false);

[Timeout] BooleanLiteral
src/App.jsx:92:56
   const [historicoBuscas, setHistoricoBuscas] = useState([]);
   const [autoAtualizar, setAutoAtualizar] = useState(true);
   const [ultimaAtualizacao, setUltimaAtualizacao] = useState(null);
-  const [buscaRealizada, setBuscaRealizada] = useState(false);
+  const [buscaRealizada, setBuscaRealizada] = useState(true);
   const intervalRef = useRef(null);
 

[Timeout] BlockStatement
src/App.jsx:96:19
   const intervalRef = useRef(null);
 
   // Autentica ao iniciar
-  useEffect(() => {
-    autenticarSPTrans();
-  }, []);
+  useEffect(() => {}, []);
 
   const limparIntervalo = () => {

[Timeout] BlockStatement
src/App.jsx:100:33
     autenticarSPTrans();
   }, []);
 
-  const limparIntervalo = () => {
-    if (intervalRef.current) {
-      clearInterval(intervalRef.current);
-      intervalRef.current = null;
-    }
-  };
+  const limparIntervalo = () => {};
 
   const registrarBusca = (termoBusca) => {

[Timeout] BlockStatement
src/App.jsx:101:30
   }, []);
 
   const limparIntervalo = () => {
-    if (intervalRef.current) {
-      clearInterval(intervalRef.current);
-      intervalRef.current = null;
-    }
+    if (intervalRef.current) {}
   };
 

[Timeout] ConditionalExpression
src/App.jsx:101:9
   }, []);
 
   const limparIntervalo = () => {
-    if (intervalRef.current) {
+    if (true) {
       clearInterval(intervalRef.current);
       intervalRef.current = null;

[Timeout] BlockStatement
src/App.jsx:107:42
     }
   };
 
-  const registrarBusca = (termoBusca) => {
-    setHistoricoBuscas((atual) =>
-      [termoBusca, ...atual.filter((item) => item !== termoBusca)].slice(0, 5),
-    );
-  };
+  const registrarBusca = (termoBusca) => {};
 
   const executarBusca = async (termoBusca) => {

[Timeout] ArrowFunction
src/App.jsx:108:24
   };
 
   const registrarBusca = (termoBusca) => {
-    setHistoricoBuscas((atual) =>
-      [termoBusca, ...atual.filter((item) => item !== termoBusca)].slice(0, 5),
+    setHistoricoBuscas(() => undefined,
     );
   };

[Timeout] ConditionalExpression
src/App.jsx:109:46
 
   const registrarBusca = (termoBusca) => {
     setHistoricoBuscas((atual) =>
-      [termoBusca, ...atual.filter((item) => item !== termoBusca)].slice(0, 5),
+      [termoBusca, ...atual.filter((item) => true)].slice(0, 5),
     );
   };

[Timeout] ConditionalExpression
src/App.jsx:109:46
 
   const registrarBusca = (termoBusca) => {
     setHistoricoBuscas((atual) =>
-      [termoBusca, ...atual.filter((item) => item !== termoBusca)].slice(0, 5),
+      [termoBusca, ...atual.filter((item) => false)].slice(0, 5),
     );
   };

[Timeout] MethodExpression
src/App.jsx:114:30
   };
 
   const executarBusca = async (termoBusca) => {
-    const termoNormalizado = termoBusca.trim();
+    const termoNormalizado = termoBusca;
 
     if (!termoNormalizado) {

[Timeout] ConditionalExpression
src/App.jsx:116:9
   const executarBusca = async (termoBusca) => {
     const termoNormalizado = termoBusca.trim();
 
-    if (!termoNormalizado) {
+    if (true) {
       setLinhas([]);
       setLinhaSelecionada(null);

[Timeout] BlockStatement
src/App.jsx:116:28
   const executarBusca = async (termoBusca) => {
     const termoNormalizado = termoBusca.trim();
 
-    if (!termoNormalizado) {
-      setLinhas([]);
-      setLinhaSelecionada(null);
-      setParadas([]);
-      setOnibus([]);
-      setUltimaAtualizacao(null);
-      setBuscaRealizada(false);
-      limparIntervalo();
-      return;
-    }
+    if (!termoNormalizado) {}
 
     setBuscandoLinhas(true);

[Timeout] BooleanLiteral
src/App.jsx:122:25
       setParadas([]);
       setOnibus([]);
       setUltimaAtualizacao(null);
-      setBuscaRealizada(false);
+      setBuscaRealizada(true);
       limparIntervalo();
       return;

[Timeout] BooleanLiteral
src/App.jsx:127:23
       return;
     }
 
-    setBuscandoLinhas(true);
+    setBuscandoLinhas(false);
     setLinhaSelecionada(null);
     setBuscaRealizada(false);

[Timeout] BooleanLiteral
src/App.jsx:129:23
 
     setBuscandoLinhas(true);
     setLinhaSelecionada(null);
-    setBuscaRealizada(false);
+    setBuscaRealizada(true);
 
     try {

[Timeout] BlockStatement
src/App.jsx:131:9
     setLinhaSelecionada(null);
     setBuscaRealizada(false);
 
-    try {
-      const data = await buscarLinhas(termoNormalizado);
-      setLinhas(data);
-      setBuscaRealizada(true);
-      registrarBusca(termoNormalizado);
-    } finally {
+    try {} finally {
       setBuscandoLinhas(false);
     }

[Timeout] BooleanLiteral
src/App.jsx:134:25
     try {
       const data = await buscarLinhas(termoNormalizado);
       setLinhas(data);
-      setBuscaRealizada(true);
+      setBuscaRealizada(false);
       registrarBusca(termoNormalizado);
     } finally {

[Timeout] BlockStatement
src/App.jsx:136:15
       setLinhas(data);
       setBuscaRealizada(true);
       registrarBusca(termoNormalizado);
-    } finally {
-      setBuscandoLinhas(false);
-    }
+    } finally {}
   };
 

[Timeout] BooleanLiteral
src/App.jsx:137:25
       setBuscaRealizada(true);
       registrarBusca(termoNormalizado);
     } finally {
-      setBuscandoLinhas(false);
+      setBuscandoLinhas(true);
     }
   };

[Timeout] BlockStatement
src/App.jsx:141:47
     }
   };
 
-  const handleBuscarLinhas = async (event) => {
-    event?.preventDefault();
-    await executarBusca(termo);
-  };
+  const handleBuscarLinhas = async (event) => {};
 
   const atualizarOnibusDaLinha = async (linha) => {

[Timeout] OptionalChaining
src/App.jsx:142:5
   };
 
   const handleBuscarLinhas = async (event) => {
-    event?.preventDefault();
+    event.preventDefault();
     await executarBusca(termo);
   };

[Timeout] BlockStatement
src/App.jsx:146:51
     await executarBusca(termo);
   };
 
-  const atualizarOnibusDaLinha = async (linha) => {
-    const veiculos = await buscarPosicaoDosOnibus(linha.cl);
-    setOnibus(veiculos);
-    setUltimaAtualizacao(new Date());
-    console.log(`Atualizado: ${veiculos.length} veiculos`);
-  };
+  const atualizarOnibusDaLinha = async (linha) => {};
 
   const configurarAutoAtualizacao = (linha) => {

[Timeout] BlockStatement
src/App.jsx:153:48
     console.log(`Atualizado: ${veiculos.length} veiculos`);
   };
 
-  const configurarAutoAtualizacao = (linha) => {
-    limparIntervalo();
-
-    if (autoAtualizar) {
-      intervalRef.current = setInterval(
-        () => atualizarOnibusDaLinha(linha),
-        AUTO_UPDATE_INTERVAL_MS,
-      );
-    }
-  };
+  const configurarAutoAtualizacao = (linha) => {};
 
   const buscarParadasELocalizacao = async (linha) => {

[Timeout] ConditionalExpression
src/App.jsx:156:9
   const configurarAutoAtualizacao = (linha) => {
     limparIntervalo();
 
-    if (autoAtualizar) {
+    if (true) {
       intervalRef.current = setInterval(
         () => atualizarOnibusDaLinha(linha),

[Timeout] BlockStatement
src/App.jsx:156:24
   const configurarAutoAtualizacao = (linha) => {
     limparIntervalo();
 
-    if (autoAtualizar) {
-      intervalRef.current = setInterval(
-        () => atualizarOnibusDaLinha(linha),
-        AUTO_UPDATE_INTERVAL_MS,
-      );
-    }
+    if (autoAtualizar) {}
   };
 

[Timeout] ArrowFunction
src/App.jsx:158:9
 
     if (autoAtualizar) {
       intervalRef.current = setInterval(
-        () => atualizarOnibusDaLinha(linha),
+        () => undefined,
         AUTO_UPDATE_INTERVAL_MS,
       );

[Timeout] BlockStatement
src/App.jsx:164:54
     }
   };
 
-  const buscarParadasELocalizacao = async (linha) => {
-    setCarregandoMapa(true);
-
-    try {
-      const paradasData = await buscarParadasPorLinha(linha.cl);
-      setParadas(paradasData);
-
-      await atualizarOnibusDaLinha(linha);
-      configurarAutoAtualizacao(linha);
-    } finally {
-      setCarregandoMapa(false);
-    }
-  };
+  const buscarParadasELocalizacao = async (linha) => {};
 
   const repetirBusca = async (termoBusca) => {

[Timeout] BooleanLiteral
src/App.jsx:165:23
   };
 
   const buscarParadasELocalizacao = async (linha) => {
-    setCarregandoMapa(true);
+    setCarregandoMapa(false);
 
     try {

[Timeout] BlockStatement
src/App.jsx:167:9
   const buscarParadasELocalizacao = async (linha) => {
     setCarregandoMapa(true);
 
-    try {
-      const paradasData = await buscarParadasPorLinha(linha.cl);
-      setParadas(paradasData);
-
-      await atualizarOnibusDaLinha(linha);
-      configurarAutoAtualizacao(linha);
-    } finally {
+    try {} finally {
       setCarregandoMapa(false);
     }

[Timeout] BlockStatement
src/App.jsx:173:15
 
       await atualizarOnibusDaLinha(linha);
       configurarAutoAtualizacao(linha);
-    } finally {
-      setCarregandoMapa(false);
-    }
+    } finally {}
   };
 

[Timeout] BooleanLiteral
src/App.jsx:174:25
       await atualizarOnibusDaLinha(linha);
       configurarAutoAtualizacao(linha);
     } finally {
-      setCarregandoMapa(false);
+      setCarregandoMapa(true);
     }
   };

[Timeout] BlockStatement
src/App.jsx:178:46
     }
   };
 
-  const repetirBusca = async (termoBusca) => {
-    setTermo(termoBusca);
-    await executarBusca(termoBusca);
-  };
+  const repetirBusca = async (termoBusca) => {};
 
   const handleAutoAtualizar = (event) => {

[Timeout] BlockStatement
src/App.jsx:183:42
     await executarBusca(termoBusca);
   };
 
-  const handleAutoAtualizar = (event) => {
-    const ligado = event.target.checked;
-    setAutoAtualizar(ligado);
-
-    limparIntervalo();
-
-    if (ligado && linhaSelecionada) {
-      intervalRef.current = setInterval(
-        () => atualizarOnibusDaLinha(linhaSelecionada),
-        AUTO_UPDATE_INTERVAL_MS,
-      );
-    }
-  };
+  const handleAutoAtualizar = (event) => {};
 
   const limparPainel = () => {

[Timeout] ConditionalExpression
src/App.jsx:189:9
 
     limparIntervalo();
 
-    if (ligado && linhaSelecionada) {
+    if (true) {
       intervalRef.current = setInterval(
         () => atualizarOnibusDaLinha(linhaSelecionada),

[Timeout] BlockStatement
src/App.jsx:189:37
 
     limparIntervalo();
 
-    if (ligado && linhaSelecionada) {
-      intervalRef.current = setInterval(
-        () => atualizarOnibusDaLinha(linhaSelecionada),
-        AUTO_UPDATE_INTERVAL_MS,
-      );
-    }
+    if (ligado && linhaSelecionada) {}
   };
 

[Timeout] ArrowFunction
src/App.jsx:191:9
 
     if (ligado && linhaSelecionada) {
       intervalRef.current = setInterval(
-        () => atualizarOnibusDaLinha(linhaSelecionada),
+        () => undefined,
         AUTO_UPDATE_INTERVAL_MS,
       );

[Timeout] BlockStatement
src/App.jsx:197:30
     }
   };
 
-  const limparPainel = () => {
-    limparIntervalo();
-    setTermo("");
-    setLinhas([]);
-    setLinhaSelecionada(null);
-    setParadas([]);
-    setOnibus([]);
-    setUltimaAtualizacao(null);
-  };
+  const limparPainel = () => {};
 
   useEffect(() => {

[Timeout] BlockStatement
src/App.jsx:207:19
     setUltimaAtualizacao(null);
   };
 
-  useEffect(() => {
-    return () => {
-      limparIntervalo();
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   const podeLimpar =

[Timeout] BlockStatement
src/App.jsx:208:18
   };
 
   useEffect(() => {
-    return () => {
-      limparIntervalo();
-    };
+    return () => {};
   }, []);
 

[Timeout] EqualityOperator
src/App.jsx:214:57
   }, []);
 
   const podeLimpar =
-    termo || linhas.length > 0 || paradas.length > 0 || onibus.length > 0;
+    termo || linhas.length > 0 || paradas.length > 0 || onibus.length <= 0;
   const descricaoLinhaSelecionada = linhaSelecionada
     ? formatarLinhaEncontrada(linhaSelecionada)

[Timeout] LogicalOperator
src/App.jsx:214:5
   }, []);
 
   const podeLimpar =
-    termo || linhas.length > 0 || paradas.length > 0 || onibus.length > 0;
+    (termo || linhas.length > 0 || paradas.length > 0) && onibus.length > 0;
   const descricaoLinhaSelecionada = linhaSelecionada
     ? formatarLinhaEncontrada(linhaSelecionada)

[Timeout] ArrowFunction
src/App.jsx:255:27
               <input
                 type="text"
                 value={termo}
-                onChange={(e) => setTermo(e.target.value)}
+                onChange={() => undefined}
                 placeholder="Ex: 8000, Paulista, Terminal"
               />

[Timeout] ConditionalExpression
src/App.jsx:262:25
             <button
               className="primary-button"
               type="submit"
-              disabled={buscandoLinhas || !termo.trim()}
+              disabled={true}
             >
               {buscandoLinhas ? "Buscando..." : "Buscar"}

[Timeout] MethodExpression
src/App.jsx:262:44
             <button
               className="primary-button"
               type="submit"
-              disabled={buscandoLinhas || !termo.trim()}
+              disabled={buscandoLinhas || !termo}
             >
               {buscandoLinhas ? "Buscando..." : "Buscar"}

[Timeout] StringLiteral
src/App.jsx:264:33
               type="submit"
               disabled={buscandoLinhas || !termo.trim()}
             >
-              {buscandoLinhas ? "Buscando..." : "Buscar"}
+              {buscandoLinhas ? "" : "Buscar"}
             </button>
           </form>

[Timeout] LogicalOperator
src/App.jsx:268:12
             </button>
           </form>
 
-          {historicoBuscas.length > 0 && (
-            <div className="history-row" aria-label="Historico de buscas">
-              <span>Recentes</span>
-              <div>
-                {historicoBuscas.map((item) => (
-                  <button
-                    key={item}
-                    type="button"
-                    onClick={() => repetirBusca(item)}
-                  >
-                    {item}
-                  </button>
-                ))}
-              </div>
-            </div>
-          )}
+          {historicoBuscas.length > 0 || <div className="history-row" aria-label="Historico de buscas">
+              <span>Recentes</span>
+              <div>
+                {historicoBuscas.map(item => <button key={item} type="button" onClick={() => repetirBusca(item)}>
+                    {item}
+                  </button>)}
+              </div>
+            </div>}
 
           {buscaRealizada && linhas.length === 0 && (

[Timeout] EqualityOperator
src/App.jsx:268:12
             </button>
           </form>
 
-          {historicoBuscas.length > 0 && (
+          {historicoBuscas.length <= 0 && (
             <div className="history-row" aria-label="Historico de buscas">
               <span>Recentes</span>

[Timeout] ArrowFunction
src/App.jsx:272:38
             <div className="history-row" aria-label="Historico de buscas">
               <span>Recentes</span>
               <div>
-                {historicoBuscas.map((item) => (
-                  <button
-                    key={item}
-                    type="button"
-                    onClick={() => repetirBusca(item)}
-                  >
-                    {item}
-                  </button>
-                ))}
+                {historicoBuscas.map(() => undefined)}
               </div>
             </div>

[Timeout] ArrowFunction
src/App.jsx:276:30
                   <button
                     key={item}
                     type="button"
-                    onClick={() => repetirBusca(item)}
+                    onClick={() => undefined}
                   >
                     {item}

[Timeout] LogicalOperator
src/App.jsx:285:12
             </div>
           )}
 
-          {buscaRealizada && linhas.length === 0 && (
-            <p className="empty-message" role="alert">
-              Nenhuma linha encontrada para esse termo.
-            </p>
-          )}
+          {buscaRealizada && linhas.length === 0 || <p className="empty-message" role="alert">
+              Nenhuma linha encontrada para esse termo.
+            </p>}
 
           <div className="action-row">

[Timeout] ConditionalExpression
src/App.jsx:285:12
             </div>
           )}
 
-          {buscaRealizada && linhas.length === 0 && (
-            <p className="empty-message" role="alert">
-              Nenhuma linha encontrada para esse termo.
-            </p>
-          )}
+          {true}
 
           <div className="action-row">

[Timeout] OptionalChaining
src/App.jsx:295:24
             <label className="field select-field">
               <span>Linha e sentido</span>
               <select
-                value={linhaSelecionada?.cl ?? ""}
+                value={linhaSelecionada.cl ?? ""}
                 disabled={linhas.length === 0}
                 onChange={(e) =>

[Timeout] LogicalOperator
src/App.jsx:295:24
             <label className="field select-field">
               <span>Linha e sentido</span>
               <select
-                value={linhaSelecionada?.cl ?? ""}
+                value={linhaSelecionada?.cl && ""}
                 disabled={linhas.length === 0}
                 onChange={(e) =>

[Timeout] ConditionalExpression
src/App.jsx:296:27
               <span>Linha e sentido</span>
               <select
                 value={linhaSelecionada?.cl ?? ""}
-                disabled={linhas.length === 0}
+                disabled={true}
                 onChange={(e) =>
                   setLinhaSelecionada(

[Timeout] EqualityOperator
src/App.jsx:296:27
               <span>Linha e sentido</span>
               <select
                 value={linhaSelecionada?.cl ?? ""}
-                disabled={linhas.length === 0}
+                disabled={linhas.length !== 0}
                 onChange={(e) =>
                   setLinhaSelecionada(

[Timeout] ArrowFunction
src/App.jsx:297:27
               <select
                 value={linhaSelecionada?.cl ?? ""}
                 disabled={linhas.length === 0}
-                onChange={(e) =>
-                  setLinhaSelecionada(
-                    linhas.find((l) => String(l.cl) === e.target.value) ?? null,
-                  )
+                onChange={() => undefined
                 }
               >

[Timeout] ConditionalExpression
src/App.jsx:299:40
                 disabled={linhas.length === 0}
                 onChange={(e) =>
                   setLinhaSelecionada(
-                    linhas.find((l) => String(l.cl) === e.target.value) ?? null,
+                    linhas.find((l) => true) ?? null,
                   )
                 }

[Timeout] ArrowFunction
src/App.jsx:299:33
                 disabled={linhas.length === 0}
                 onChange={(e) =>
                   setLinhaSelecionada(
-                    linhas.find((l) => String(l.cl) === e.target.value) ?? null,
+                    linhas.find(() => undefined) ?? null,
                   )
                 }

[Timeout] ConditionalExpression
src/App.jsx:304:20
                 }
               >
                 <option value="">
-                  {linhas.length > 0
+                  {false
                     ? "Selecione uma linha..."
                     : "Busque para selecionar"}

[Timeout] ConditionalExpression
src/App.jsx:304:20
                 }
               >
                 <option value="">
-                  {linhas.length > 0
+                  {true
                     ? "Selecione uma linha..."
                     : "Busque para selecionar"}
