[Timeout] ArrowFunction
src/App.jsx:308:29
                     ? "Selecione uma linha..."
                     : "Busque para selecionar"}
                 </option>
-                {linhas.map((l) => (
-                  <option key={l.cl} value={l.cl}>
-                    {formatarLinhaEncontrada(l)}
-                  </option>
-                ))}
+                {linhas.map(() => undefined)}
               </select>
             </label>

[Timeout] LogicalOperator
src/App.jsx:319:25
             <button
               className="secondary-button"
               type="button"
-              disabled={!linhaSelecionada || carregandoMapa}
+              disabled={!linhaSelecionada && carregandoMapa}
               onClick={() => buscarParadasELocalizacao(linhaSelecionada)}
             >

[Timeout] ConditionalExpression
src/App.jsx:319:25
             <button
               className="secondary-button"
               type="button"
-              disabled={!linhaSelecionada || carregandoMapa}
+              disabled={true}
               onClick={() => buscarParadasELocalizacao(linhaSelecionada)}
             >

[Timeout] ArrowFunction
src/App.jsx:320:24
               className="secondary-button"
               type="button"
               disabled={!linhaSelecionada || carregandoMapa}
-              onClick={() => buscarParadasELocalizacao(linhaSelecionada)}
+              onClick={() => undefined}
             >
               {carregandoMapa ? "Carregando..." : "Mostrar no mapa"}

[Timeout] StringLiteral
src/App.jsx:322:51
               disabled={!linhaSelecionada || carregandoMapa}
               onClick={() => buscarParadasELocalizacao(linhaSelecionada)}
             >
-              {carregandoMapa ? "Carregando..." : "Mostrar no mapa"}
+              {carregandoMapa ? "Carregando..." : ""}
             </button>
           </div>

[Timeout] ConditionalExpression
src/App.jsx:340:27
               <button
                 className="ghost-button"
                 type="button"
-                disabled={!linhaSelecionada || carregandoMapa}
+                disabled={false}
                 onClick={() => atualizarOnibusDaLinha(linhaSelecionada)}
               >

[Timeout] BooleanLiteral
src/App.jsx:340:27
               <button
                 className="ghost-button"
                 type="button"
-                disabled={!linhaSelecionada || carregandoMapa}
+                disabled={linhaSelecionada || carregandoMapa}
                 onClick={() => atualizarOnibusDaLinha(linhaSelecionada)}
               >

[Timeout] ArrowFunction
src/App.jsx:341:26
                 className="ghost-button"
                 type="button"
                 disabled={!linhaSelecionada || carregandoMapa}
-                onClick={() => atualizarOnibusDaLinha(linhaSelecionada)}
+                onClick={() => undefined}
               >
                 Atualizar agora

[Timeout] BooleanLiteral
src/App.jsx:348:27
               <button
                 className="ghost-button"
                 type="button"
-                disabled={!podeLimpar}
+                disabled={podeLimpar}
                 onClick={limparPainel}
               >

[Timeout] ConditionalExpression
src/App.jsx:356:12
             </div>
           </div>
 
-          {descricaoLinhaSelecionada && (
-            <div className="selected-line" aria-label="Linha ativa">
-              <span>Linha ativa</span>
-              <strong>{descricaoLinhaSelecionada}</strong>
-            </div>
-          )}
+          {false}
 
           <p className="status-line" role="status">

[Timeout] LogicalOperator
src/App.jsx:356:12
             </div>
           </div>
 
-          {descricaoLinhaSelecionada && (
-            <div className="selected-line" aria-label="Linha ativa">
-              <span>Linha ativa</span>
-              <strong>{descricaoLinhaSelecionada}</strong>
-            </div>
-          )}
+          {descricaoLinhaSelecionada || <div className="selected-line" aria-label="Linha ativa">
+              <span>Linha ativa</span>
+              <strong>{descricaoLinhaSelecionada}</strong>
+            </div>}
 
           <p className="status-line" role="status">

[Timeout] OptionalChaining
src/App.jsx:380:26
           <MapView
             paradas={paradas}
             onibus={onibus}
-            codigoLinha={linhaSelecionada?.cl ?? null}
+            codigoLinha={linhaSelecionada.cl ?? null}
           />
         </section>

[Timeout] LogicalOperator
src/App.jsx:380:26
           <MapView
             paradas={paradas}
             onibus={onibus}
-            codigoLinha={linhaSelecionada?.cl ?? null}
+            codigoLinha={linhaSelecionada?.cl && null}
           />
         </section>
