[Timeout] UnaryOperator
src/components/MapView.jsx:14:20
   iconUrl: busIcon,
   iconSize: [30, 30],
   iconAnchor: [20, 40],
-  popupAnchor: [0, -40],
+  popupAnchor: [0, +40],
 });
 

[Timeout] UnaryOperator
src/components/MapView.jsx:21:20
   iconUrl: busStopIcon,
   iconSize: [35, 35],
   iconAnchor: [17, 35],
-  popupAnchor: [0, -35],
+  popupAnchor: [0, +35],
 });
 

[Timeout] ArrayDeclaration
src/components/MapView.jsx:21:16
   iconUrl: busStopIcon,
   iconSize: [35, 35],
   iconAnchor: [17, 35],
-  popupAnchor: [0, -35],
+  popupAnchor: [],
 });
 

[Timeout] ArrayDeclaration
src/components/MapView.jsx:24:58
   popupAnchor: [0, -35],
 });
 
-export default function MapView({ paradas = [], onibus = [], codigoLinha }) {
+export default function MapView({ paradas = [], onibus = ["Stryker was here"], codigoLinha }) {
   const [previsoes, setPrevisoes] = useState({});
   const center = [-23.55052, -46.633308]; // centro de SP

[Timeout] UnaryOperator
src/components/MapView.jsx:26:30
 
 export default function MapView({ paradas = [], onibus = [], codigoLinha }) {
   const [previsoes, setPrevisoes] = useState({});
-  const center = [-23.55052, -46.633308]; // centro de SP
+  const center = [-23.55052, +46.633308]; // centro de SP
   const paradasComCoordenadas = paradas.filter(
     (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)

[Timeout] UnaryOperator
src/components/MapView.jsx:26:19
 
 export default function MapView({ paradas = [], onibus = [], codigoLinha }) {
   const [previsoes, setPrevisoes] = useState({});
-  const center = [-23.55052, -46.633308]; // centro de SP
+  const center = [+23.55052, -46.633308]; // centro de SP
   const paradasComCoordenadas = paradas.filter(
     (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)

[Timeout] MethodExpression
src/components/MapView.jsx:27:33
 export default function MapView({ paradas = [], onibus = [], codigoLinha }) {
   const [previsoes, setPrevisoes] = useState({});
   const center = [-23.55052, -46.633308]; // centro de SP
-  const paradasComCoordenadas = paradas.filter(
-    (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
-  );
+  const paradasComCoordenadas = paradas;
   const onibusComCoordenadas = onibus.filter(
     (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo?.px)

[Timeout] ConditionalExpression
src/components/MapView.jsx:28:17
   const [previsoes, setPrevisoes] = useState({});
   const center = [-23.55052, -46.633308]; // centro de SP
   const paradasComCoordenadas = paradas.filter(
-    (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
+    (parada) => true
   );
   const onibusComCoordenadas = onibus.filter(

[Timeout] ConditionalExpression
src/components/MapView.jsx:28:17
   const [previsoes, setPrevisoes] = useState({});
   const center = [-23.55052, -46.633308]; // centro de SP
   const paradasComCoordenadas = paradas.filter(
-    (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
+    (parada) => false
   );
   const onibusComCoordenadas = onibus.filter(

[Timeout] MethodExpression
src/components/MapView.jsx:30:32
   const paradasComCoordenadas = paradas.filter(
     (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
   );
-  const onibusComCoordenadas = onibus.filter(
-    (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo?.px)
-  );
+  const onibusComCoordenadas = onibus;
 
   async function handleClickParada(parada) {

[Timeout] LogicalOperator
src/components/MapView.jsx:31:18
     (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
   );
   const onibusComCoordenadas = onibus.filter(
-    (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo?.px)
+    (veiculo) => Number.isFinite(veiculo?.py) || Number.isFinite(veiculo?.px)
   );
 

[Timeout] OptionalChaining
src/components/MapView.jsx:31:66
     (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
   );
   const onibusComCoordenadas = onibus.filter(
-    (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo?.px)
+    (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo.px)
   );
 

[Timeout] BlockStatement
src/components/MapView.jsx:34:44
     (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo?.px)
   );
 
-  async function handleClickParada(parada) {
-    if (!codigoLinha) {
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
-      return;
-    }
-
-    try {
-      const data = await buscarPrevisao(parada.cp, codigoLinha);
-      const veiculos = normalizarPrevisoes(data);
-
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: veiculos,
-      }));
-    } catch (err) {
-      console.error("Erro ao buscar previsão:", err);
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
-    }
-  }
+  async function handleClickParada(parada) {}
 
   return (

[Timeout] BooleanLiteral
src/components/MapView.jsx:35:9
   );
 
   async function handleClickParada(parada) {
-    if (!codigoLinha) {
+    if (codigoLinha) {
       setPrevisoes((prev) => ({
         ...prev,

[Timeout] ConditionalExpression
src/components/MapView.jsx:35:9
   );
 
   async function handleClickParada(parada) {
-    if (!codigoLinha) {
+    if (true) {
       setPrevisoes((prev) => ({
         ...prev,

[Timeout] ArrowFunction
src/components/MapView.jsx:36:20
 
   async function handleClickParada(parada) {
     if (!codigoLinha) {
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
+      setPrevisoes(() => undefined);
       return;
     }

[Timeout] ObjectLiteral
src/components/MapView.jsx:36:31
 
   async function handleClickParada(parada) {
     if (!codigoLinha) {
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
+      setPrevisoes((prev) => ({}));
       return;
     }

[Timeout] BlockStatement
src/components/MapView.jsx:43:9
       return;
     }
 
-    try {
-      const data = await buscarPrevisao(parada.cp, codigoLinha);
-      const veiculos = normalizarPrevisoes(data);
-
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: veiculos,
-      }));
-    } catch (err) {
+    try {} catch (err) {
       console.error("Erro ao buscar previsão:", err);
       setPrevisoes((prev) => ({

[Timeout] ArrowFunction
src/components/MapView.jsx:47:20
       const data = await buscarPrevisao(parada.cp, codigoLinha);
       const veiculos = normalizarPrevisoes(data);
 
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: veiculos,
-      }));
+      setPrevisoes(() => undefined);
     } catch (err) {
       console.error("Erro ao buscar previsão:", err);

[Timeout] BlockStatement
src/components/MapView.jsx:51:19
         ...prev,
         [parada.cp]: veiculos,
       }));
-    } catch (err) {
-      console.error("Erro ao buscar previsão:", err);
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
-    }
+    } catch (err) {}
   }
 

[Timeout] ArrowFunction
src/components/MapView.jsx:53:20
       }));
     } catch (err) {
       console.error("Erro ao buscar previsão:", err);
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
+      setPrevisoes(() => undefined);
     }
   }

[Timeout] ObjectLiteral
src/components/MapView.jsx:53:31
       }));
     } catch (err) {
       console.error("Erro ao buscar previsão:", err);
-      setPrevisoes((prev) => ({
-        ...prev,
-        [parada.cp]: [],
-      }));
+      setPrevisoes((prev) => ({}));
     }
   }

[Timeout] StringLiteral
src/components/MapView.jsx:64:24
     <MapContainer
       center={center}
       zoom={12}
-      style={{ height: "100%", width: "100%" }}
+      style={{ height: "", width: "100%" }}
     >
       <TileLayer

[Timeout] ArrowFunction
src/components/MapView.jsx:78:20
           position={[p.py, p.px]}
           icon={iconeParada}
           eventHandlers={{
-            click: () => handleClickParada(p),
+            click: () => undefined,
           }}
         >

[Timeout] EqualityOperator
src/components/MapView.jsx:87:15
             Código: {p.cp}
             <hr />
             {previsoes[p.cp] ? (
-              previsoes[p.cp].length > 0 ? (
+              previsoes[p.cp].length <= 0 ? (
                 previsoes[p.cp].map((v, i) => (
                   <div key={i}>

[Timeout] EqualityOperator
src/components/MapView.jsx:87:15
             Código: {p.cp}
             <hr />
             {previsoes[p.cp] ? (
-              previsoes[p.cp].length > 0 ? (
+              previsoes[p.cp].length >= 0 ? (
                 previsoes[p.cp].map((v, i) => (
                   <div key={i}>

[Timeout] ArrowFunction
src/components/MapView.jsx:88:37
             <hr />
             {previsoes[p.cp] ? (
               previsoes[p.cp].length > 0 ? (
-                previsoes[p.cp].map((v, i) => (
-                  <div key={i}>
-                    Previsão: <br /> 🚌 <b>{v.linha}</b> — {v.horario}
-                    {v.minutos !== null && v.minutos !== undefined
-                      ? ` (${v.minutos} min)`
-                      : ""}
-                  </div>
-                ))
+                previsoes[p.cp].map(() => undefined)
               ) : (
                 <span>Sem previsão disponível</span>

[Timeout] ConditionalExpression
src/components/MapView.jsx:91:44
                 previsoes[p.cp].map((v, i) => (
                   <div key={i}>
                     Previsão: <br /> 🚌 <b>{v.linha}</b> — {v.horario}
-                    {v.minutos !== null && v.minutos !== undefined
+                    {v.minutos !== null && true
                       ? ` (${v.minutos} min)`
                       : ""}

[Timeout] LogicalOperator
src/components/MapView.jsx:91:22
                 previsoes[p.cp].map((v, i) => (
                   <div key={i}>
                     Previsão: <br /> 🚌 <b>{v.linha}</b> — {v.horario}
-                    {v.minutos !== null && v.minutos !== undefined
+                    {v.minutos !== null || v.minutos !== undefined
                       ? ` (${v.minutos} min)`
                       : ""}

[Timeout] StringLiteral
src/components/MapView.jsx:92:25
                   <div key={i}>
                     Previsão: <br /> 🚌 <b>{v.linha}</b> — {v.horario}
                     {v.minutos !== null && v.minutos !== undefined
-                      ? ` (${v.minutos} min)`
+                      ? ``
                       : ""}
                   </div>

[Timeout] ArrowFunction
src/components/MapView.jsx:107:33
       ))}
 
       {/* Ônibus (vermelho) */}
-      {onibusComCoordenadas.map((v) => (
-        <Marker key={v.p} position={[v.py, v.px]} icon={iconeOnibus}>
-          <Popup>
-            🚌 Ônibus {v.p}
-            <br />
-            Atualizado: {new Date(v.ta).toLocaleTimeString()}
-          </Popup>
-        </Marker>
-      ))}
+      {onibusComCoordenadas.map(() => undefined)}
     </MapContainer>
   );

[Timeout] ArrayDeclaration
src/components/MapView.jsx:108:37
 
       {/* Ônibus (vermelho) */}
       {onibusComCoordenadas.map((v) => (
-        <Marker key={v.p} position={[v.py, v.px]} icon={iconeOnibus}>
+        <Marker key={v.p} position={[]} icon={iconeOnibus}>
           <Popup>
             🚌 Ônibus {v.p}
