[Timeout] BlockStatement
src/services/normalizarPrevisao.js:1:29
-function getLinhas(payload) {
-  if (Array.isArray(payload)) {
-    return payload;
-  }
-
-  if (Array.isArray(payload?.linhas)) {
-    return payload.linhas;
-  }
-
-  if (Array.isArray(payload?.p?.l)) {
-    return payload.p.l;
-  }
-
-  if (Array.isArray(payload?.l)) {
-    return payload.l;
-  }
-
-  return [];
-}
+function getLinhas(payload) {}
 
 function getDescricaoLinha(linha) {

[Timeout] ConditionalExpression
src/services/normalizarPrevisao.js:2:7
 function getLinhas(payload) {
-  if (Array.isArray(payload)) {
+  if (true) {
     return payload;
   }

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:2:31
 function getLinhas(payload) {
-  if (Array.isArray(payload)) {
-    return payload;
-  }
+  if (Array.isArray(payload)) {}
 
   if (Array.isArray(payload?.linhas)) {

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:6:39
     return payload;
   }
 
-  if (Array.isArray(payload?.linhas)) {
-    return payload.linhas;
-  }
+  if (Array.isArray(payload?.linhas)) {}
 
   if (Array.isArray(payload?.p?.l)) {

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:6:21
     return payload;
   }
 
-  if (Array.isArray(payload?.linhas)) {
+  if (Array.isArray(payload.linhas)) {
     return payload.linhas;
   }

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:10:37
     return payload.linhas;
   }
 
-  if (Array.isArray(payload?.p?.l)) {
-    return payload.p.l;
-  }
+  if (Array.isArray(payload?.p?.l)) {}
 
   if (Array.isArray(payload?.l)) {

[Timeout] ConditionalExpression
src/services/normalizarPrevisao.js:10:7
     return payload.linhas;
   }
 
-  if (Array.isArray(payload?.p?.l)) {
+  if (true) {
     return payload.p.l;
   }

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:14:34
     return payload.p.l;
   }
 
-  if (Array.isArray(payload?.l)) {
-    return payload.l;
-  }
+  if (Array.isArray(payload?.l)) {}
 
   return [];

[Timeout] ConditionalExpression
src/services/normalizarPrevisao.js:14:7
     return payload.p.l;
   }
 
-  if (Array.isArray(payload?.l)) {
+  if (false) {
     return payload.l;
   }

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:21:35
   return [];
 }
 
-function getDescricaoLinha(linha) {
-  if (linha?.descricao) {
-    return linha.descricao;
-  }
-
-  if (linha?.lt0 && linha?.lt1) {
-    return `${linha.lt0} ⇄ ${linha.lt1}`;
-  }
-
-  return linha?.c ?? linha?.cl ?? linha?.codigoLinha ?? "Linha";
-}
+function getDescricaoLinha(linha) {}
 
 function normalizeVeiculo(veiculo, linha) {

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:22:25
 }
 
 function getDescricaoLinha(linha) {
-  if (linha?.descricao) {
-    return linha.descricao;
-  }
+  if (linha?.descricao) {}
 
   if (linha?.lt0 && linha?.lt1) {

[Timeout] ConditionalExpression
src/services/normalizarPrevisao.js:22:7
 }
 
 function getDescricaoLinha(linha) {
-  if (linha?.descricao) {
+  if (false) {
     return linha.descricao;
   }

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:26:7
     return linha.descricao;
   }
 
-  if (linha?.lt0 && linha?.lt1) {
+  if (linha?.lt0 || linha?.lt1) {
     return `${linha.lt0} ⇄ ${linha.lt1}`;
   }

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:26:7
     return linha.descricao;
   }
 
-  if (linha?.lt0 && linha?.lt1) {
+  if (linha.lt0 && linha?.lt1) {
     return `${linha.lt0} ⇄ ${linha.lt1}`;
   }

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:30:10
     return `${linha.lt0} ⇄ ${linha.lt1}`;
   }
 
-  return linha?.c ?? linha?.cl ?? linha?.codigoLinha ?? "Linha";
+  return (linha?.c ?? linha?.cl ?? linha?.codigoLinha) && "Linha";
 }
 

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:30:10
     return `${linha.lt0} ⇄ ${linha.lt1}`;
   }
 
-  return linha?.c ?? linha?.cl ?? linha?.codigoLinha ?? "Linha";
+  return linha?.c && linha?.cl ?? linha?.codigoLinha ?? "Linha";
 }
 

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:33:43
   return linha?.c ?? linha?.cl ?? linha?.codigoLinha ?? "Linha";
 }
 
-function normalizeVeiculo(veiculo, linha) {
-  return {
-    placa: veiculo?.placa ?? veiculo?.p ?? null,
-    horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
-    minutos: veiculo?.minutos ?? null,
-    ativo: veiculo?.ativo ?? veiculo?.a ?? null,
-    py: veiculo?.py ?? null,
-    px: veiculo?.px ?? null,
-    linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,
-    descricaoLinha: getDescricaoLinha(linha),
-  };
-}
+function normalizeVeiculo(veiculo, linha) {}
 
 export function normalizarPrevisoes(payload) {

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:35:30
 
 function normalizeVeiculo(veiculo, linha) {
   return {
-    placa: veiculo?.placa ?? veiculo?.p ?? null,
+    placa: veiculo?.placa ?? veiculo.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:35:12
 
 function normalizeVeiculo(veiculo, linha) {
   return {
-    placa: veiculo?.placa ?? veiculo?.p ?? null,
+    placa: veiculo.placa ?? veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:36:59
 function normalizeVeiculo(veiculo, linha) {
   return {
     placa: veiculo?.placa ?? veiculo?.p ?? null,
-    horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
+    horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo.t ?? null,
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:36:39
 function normalizeVeiculo(veiculo, linha) {
   return {
     placa: veiculo?.placa ?? veiculo?.p ?? null,
-    horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
+    horario: veiculo?.horaPrevista ?? veiculo.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:37:14
   return {
     placa: veiculo?.placa ?? veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
-    minutos: veiculo?.minutos ?? null,
+    minutos: veiculo.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:37:14
   return {
     placa: veiculo?.placa ?? veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
-    minutos: veiculo?.minutos ?? null,
+    minutos: veiculo?.minutos && null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:38:12
     placa: veiculo?.placa ?? veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
-    ativo: veiculo?.ativo ?? veiculo?.a ?? null,
+    ativo: (veiculo?.ativo ?? veiculo?.a) && null,
     py: veiculo?.py ?? null,
     px: veiculo?.px ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:38:12
     placa: veiculo?.placa ?? veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
-    ativo: veiculo?.ativo ?? veiculo?.a ?? null,
+    ativo: veiculo.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,
     px: veiculo?.px ?? null,

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:39:9
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
-    py: veiculo?.py ?? null,
+    py: veiculo?.py && null,
     px: veiculo?.px ?? null,
     linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:39:9
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
-    py: veiculo?.py ?? null,
+    py: veiculo.py ?? null,
     px: veiculo?.px ?? null,
     linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:40:9
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,
-    px: veiculo?.px ?? null,
+    px: veiculo.px ?? null,
     linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,
     descricaoLinha: getDescricaoLinha(linha),

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:40:9
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,
-    px: veiculo?.px ?? null,
+    px: veiculo?.px && null,
     linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,
     descricaoLinha: getDescricaoLinha(linha),

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:41:12
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,
     px: veiculo?.px ?? null,
-    linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,
+    linha: linha?.codigoLinha && linha?.cl ?? linha?.c ?? null,
     descricaoLinha: getDescricaoLinha(linha),
   };

[Timeout] LogicalOperator
src/services/normalizarPrevisao.js:41:12
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
     py: veiculo?.py ?? null,
     px: veiculo?.px ?? null,
-    linha: linha?.codigoLinha ?? linha?.cl ?? linha?.c ?? null,
+    linha: (linha?.codigoLinha ?? linha?.cl ?? linha?.c) && null,
     descricaoLinha: getDescricaoLinha(linha),
   };

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:46:46
   };
 }
 
-export function normalizarPrevisoes(payload) {
-  return getLinhas(payload).flatMap((linha) => {
-    const veiculos = linha?.veiculos ?? linha?.vs ?? [];
-
-    if (!Array.isArray(veiculos)) {
-      return [];
-    }
-
-    return veiculos.map((veiculo) => normalizeVeiculo(veiculo, linha));
-  });
-}
+export function normalizarPrevisoes(payload) {}
 

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:47:48
 }
 
 export function normalizarPrevisoes(payload) {
-  return getLinhas(payload).flatMap((linha) => {
-    const veiculos = linha?.veiculos ?? linha?.vs ?? [];
-
-    if (!Array.isArray(veiculos)) {
-      return [];
-    }
-
-    return veiculos.map((veiculo) => normalizeVeiculo(veiculo, linha));
-  });
+  return getLinhas(payload).flatMap((linha) => {});
 }
 

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:48:22
 
 export function normalizarPrevisoes(payload) {
   return getLinhas(payload).flatMap((linha) => {
-    const veiculos = linha?.veiculos ?? linha?.vs ?? [];
+    const veiculos = linha.veiculos ?? linha?.vs ?? [];
 
     if (!Array.isArray(veiculos)) {

[Timeout] OptionalChaining
src/services/normalizarPrevisao.js:48:41
 
 export function normalizarPrevisoes(payload) {
   return getLinhas(payload).flatMap((linha) => {
-    const veiculos = linha?.veiculos ?? linha?.vs ?? [];
+    const veiculos = linha?.veiculos ?? linha.vs ?? [];
 
     if (!Array.isArray(veiculos)) {

[Timeout] BlockStatement
src/services/normalizarPrevisao.js:50:35
   return getLinhas(payload).flatMap((linha) => {
     const veiculos = linha?.veiculos ?? linha?.vs ?? [];
 
-    if (!Array.isArray(veiculos)) {
-      return [];
-    }
+    if (!Array.isArray(veiculos)) {}
 
     return veiculos.map((veiculo) => normalizeVeiculo(veiculo, linha));

[Timeout] ConditionalExpression
src/services/normalizarPrevisao.js:50:9
   return getLinhas(payload).flatMap((linha) => {
     const veiculos = linha?.veiculos ?? linha?.vs ?? [];
 
-    if (!Array.isArray(veiculos)) {
+    if (false) {
       return [];
     }

[Timeout] ArrowFunction
src/services/normalizarPrevisao.js:54:25
       return [];
     }
 
-    return veiculos.map((veiculo) => normalizeVeiculo(veiculo, linha));
+    return veiculos.map(() => undefined);
   });
 }
