[Timeout] LogicalOperator
src/services/sptransAPI.js:3:18
 import axios from "axios";
 
-const API_BASE = import.meta.env.VITE_API_URL || "http://localhost:3000/api";
+const API_BASE = import.meta.env.VITE_API_URL && "http://localhost:3000/api";
 
 const api = axios.create({

[Timeout] ConditionalExpression
src/services/sptransAPI.js:3:18
 import axios from "axios";
 
-const API_BASE = import.meta.env.VITE_API_URL || "http://localhost:3000/api";
+const API_BASE = false;
 
 const api = axios.create({

[Timeout] BlockStatement
src/services/sptransAPI.js:9:43
   baseURL: API_BASE,
 });
 
-export async function autenticarSPTrans() {
-  try {
-    console.log("Autenticando na SPTrans...");
-    await api.post("/Login/Autenticar");
-    console.log("Autenticacao concluida.");
-  } catch (err) {
-    console.error("Erro ao autenticar SPTrans:", err.message);
-  }
-}
+export async function autenticarSPTrans() {}
 
 export async function buscarLinhas(termo) {

[Timeout] BlockStatement
src/services/sptransAPI.js:10:7
 });
 
 export async function autenticarSPTrans() {
-  try {
-    console.log("Autenticando na SPTrans...");
-    await api.post("/Login/Autenticar");
-    console.log("Autenticacao concluida.");
-  } catch (err) {
+  try {} catch (err) {
     console.error("Erro ao autenticar SPTrans:", err.message);
   }

[Timeout] StringLiteral
src/services/sptransAPI.js:12:20
 export async function autenticarSPTrans() {
   try {
     console.log("Autenticando na SPTrans...");
-    await api.post("/Login/Autenticar");
+    await api.post("");
     console.log("Autenticacao concluida.");
   } catch (err) {

[Timeout] BlockStatement
src/services/sptransAPI.js:14:17
     console.log("Autenticando na SPTrans...");
     await api.post("/Login/Autenticar");
     console.log("Autenticacao concluida.");
-  } catch (err) {
-    console.error("Erro ao autenticar SPTrans:", err.message);
-  }
+  } catch (err) {}
 }
 

[Timeout] BlockStatement
src/services/sptransAPI.js:19:43
   }
 }
 
-export async function buscarLinhas(termo) {
-  try {
-    const params = new URLSearchParams({ termosBusca: termo });
-    const resp = await api.get(`/Linha/Buscar?${params}`);
-    return resp.data;
-  } catch (err) {
-    console.error("Erro ao buscar linhas:", err.message);
-    return [];
-  }
-}
+export async function buscarLinhas(termo) {}
 
 export async function buscarParadasPorLinha(codigoLinha) {

[Timeout] BlockStatement
src/services/sptransAPI.js:20:7
 }
 
 export async function buscarLinhas(termo) {
-  try {
-    const params = new URLSearchParams({ termosBusca: termo });
-    const resp = await api.get(`/Linha/Buscar?${params}`);
-    return resp.data;
-  } catch (err) {
+  try {} catch (err) {
     console.error("Erro ao buscar linhas:", err.message);
     return [];

[Timeout] ObjectLiteral
src/services/sptransAPI.js:21:40
 
 export async function buscarLinhas(termo) {
   try {
-    const params = new URLSearchParams({ termosBusca: termo });
+    const params = new URLSearchParams({});
     const resp = await api.get(`/Linha/Buscar?${params}`);
     return resp.data;

[Timeout] BlockStatement
src/services/sptransAPI.js:24:17
     const params = new URLSearchParams({ termosBusca: termo });
     const resp = await api.get(`/Linha/Buscar?${params}`);
     return resp.data;
-  } catch (err) {
-    console.error("Erro ao buscar linhas:", err.message);
-    return [];
-  }
+  } catch (err) {}
 }
 

[Timeout] ArrayDeclaration
src/services/sptransAPI.js:26:12
     return resp.data;
   } catch (err) {
     console.error("Erro ao buscar linhas:", err.message);
-    return [];
+    return ["Stryker was here"];
   }
 }

[Timeout] BlockStatement
src/services/sptransAPI.js:30:58
   }
 }
 
-export async function buscarParadasPorLinha(codigoLinha) {
-  try {
-    const params = new URLSearchParams({ codigoLinha });
-    const resp = await api.get(`/Parada/BuscarParadasPorLinha?${params}`);
-    return resp.data;
-  } catch (err) {
-    console.error("Erro ao buscar paradas:", err.message);
-    return [];
-  }
-}
+export async function buscarParadasPorLinha(codigoLinha) {}
 
 export async function buscarPosicaoDosOnibus(codigoLinha) {

[Timeout] BlockStatement
src/services/sptransAPI.js:31:7
 }
 
 export async function buscarParadasPorLinha(codigoLinha) {
-  try {
-    const params = new URLSearchParams({ codigoLinha });
-    const resp = await api.get(`/Parada/BuscarParadasPorLinha?${params}`);
-    return resp.data;
-  } catch (err) {
+  try {} catch (err) {
     console.error("Erro ao buscar paradas:", err.message);
     return [];

[Timeout] BlockStatement
src/services/sptransAPI.js:35:17
     const params = new URLSearchParams({ codigoLinha });
     const resp = await api.get(`/Parada/BuscarParadasPorLinha?${params}`);
     return resp.data;
-  } catch (err) {
-    console.error("Erro ao buscar paradas:", err.message);
-    return [];
-  }
+  } catch (err) {}
 }
 

[Timeout] StringLiteral
src/services/sptransAPI.js:36:19
     const resp = await api.get(`/Parada/BuscarParadasPorLinha?${params}`);
     return resp.data;
   } catch (err) {
-    console.error("Erro ao buscar paradas:", err.message);
+    console.error("", err.message);
     return [];
   }

[Timeout] BlockStatement
src/services/sptransAPI.js:41:59
   }
 }
 
-export async function buscarPosicaoDosOnibus(codigoLinha) {
-  try {
-    const params = new URLSearchParams({ codigoLinha });
-    const resp = await api.get(`/Posicao/Linha?${params}`);
-    return resp.data?.vs || [];
-  } catch (err) {
-    console.error("Erro ao buscar posicao dos onibus:", err.message);
-    return [];
-  }
-}
+export async function buscarPosicaoDosOnibus(codigoLinha) {}
 
 export async function buscarPrevisao(codigoParada, codigoLinha) {

[Timeout] BlockStatement
src/services/sptransAPI.js:42:7
 }
 
 export async function buscarPosicaoDosOnibus(codigoLinha) {
-  try {
-    const params = new URLSearchParams({ codigoLinha });
-    const resp = await api.get(`/Posicao/Linha?${params}`);
-    return resp.data?.vs || [];
-  } catch (err) {
+  try {} catch (err) {
     console.error("Erro ao buscar posicao dos onibus:", err.message);
     return [];

[Timeout] LogicalOperator
src/services/sptransAPI.js:45:12
   try {
     const params = new URLSearchParams({ codigoLinha });
     const resp = await api.get(`/Posicao/Linha?${params}`);
-    return resp.data?.vs || [];
+    return resp.data?.vs && [];
   } catch (err) {
     console.error("Erro ao buscar posicao dos onibus:", err.message);

[Timeout] ConditionalExpression
src/services/sptransAPI.js:45:12
   try {
     const params = new URLSearchParams({ codigoLinha });
     const resp = await api.get(`/Posicao/Linha?${params}`);
-    return resp.data?.vs || [];
+    return false;
   } catch (err) {
     console.error("Erro ao buscar posicao dos onibus:", err.message);

[Timeout] BlockStatement
src/services/sptransAPI.js:46:17
     const params = new URLSearchParams({ codigoLinha });
     const resp = await api.get(`/Posicao/Linha?${params}`);
     return resp.data?.vs || [];
-  } catch (err) {
-    console.error("Erro ao buscar posicao dos onibus:", err.message);
-    return [];
-  }
+  } catch (err) {}
 }
 

[Timeout] StringLiteral
src/services/sptransAPI.js:47:19
     const resp = await api.get(`/Posicao/Linha?${params}`);
     return resp.data?.vs || [];
   } catch (err) {
-    console.error("Erro ao buscar posicao dos onibus:", err.message);
+    console.error("", err.message);
     return [];
   }

[Timeout] ArrayDeclaration
src/services/sptransAPI.js:48:12
     return resp.data?.vs || [];
   } catch (err) {
     console.error("Erro ao buscar posicao dos onibus:", err.message);
-    return [];
+    return ["Stryker was here"];
   }
 }

[Timeout] BlockStatement
src/services/sptransAPI.js:52:65
   }
 }
 
-export async function buscarPrevisao(codigoParada, codigoLinha) {
-  try {
-    const params = new URLSearchParams({ codigoParada, codigoLinha });
-    const resp = await api.get(`/Previsao?${params}`);
-    return resp.data;
-  } catch (err) {
-    console.error("Erro ao buscar previsao:", err.message);
-    return null;
-  }
-}
+export async function buscarPrevisao(codigoParada, codigoLinha) {}
 
 export default api;

[Timeout] BlockStatement
src/services/sptransAPI.js:53:7
 }
 
 export async function buscarPrevisao(codigoParada, codigoLinha) {
-  try {
-    const params = new URLSearchParams({ codigoParada, codigoLinha });
-    const resp = await api.get(`/Previsao?${params}`);
-    return resp.data;
-  } catch (err) {
+  try {} catch (err) {
     console.error("Erro ao buscar previsao:", err.message);
     return null;

[Timeout] BlockStatement
src/services/sptransAPI.js:57:17
     const params = new URLSearchParams({ codigoParada, codigoLinha });
     const resp = await api.get(`/Previsao?${params}`);
     return resp.data;
-  } catch (err) {
-    console.error("Erro ao buscar previsao:", err.message);
-    return null;
-  }
+  } catch (err) {}
 }
 

[Timeout] StringLiteral
src/services/sptransAPI.js:58:19
     const resp = await api.get(`/Previsao?${params}`);
     return resp.data;
   } catch (err) {
-    console.error("Erro ao buscar previsao:", err.message);
+    console.error("", err.message);
     return null;
   }
