[Killed] ArrowFunction
src/components/MapView.jsx:31:5
     (parada) => Number.isFinite(parada?.py) && Number.isFinite(parada?.px)
   );
   const onibusComCoordenadas = onibus.filter(
-    (veiculo) => Number.isFinite(veiculo?.py) && Number.isFinite(veiculo?.px)
+    () => undefined
   );
 
killedBy: MapView renderiza paradas e onibus com Leaflet mockado
statusReason: Unable to find an element with the text: /Onibus|Ônibus/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >

[Killed] ConditionalExpression
src/components/MapView.jsx:91:22
                 previsoes[p.cp].map((v, i) => (
                   <div key={i}>
                     Previsão: <br /> 🚌 <b>{v.linha}</b> — {v.horario}
-                    {v.minutos !== null && v.minutos !== undefined
+                    {false
                       ? ` (${v.minutos} min)`
                       : ""}
killedBy: MapView carrega e exibe previsoes normalizadas pelo backend ao clicar na parada
statusReason: Unable to find an element with the text: /10 min/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >

[Killed] EqualityOperator
src/components/MapView.jsx:91:22
                 previsoes[p.cp].map((v, i) => (
                   <div key={i}>
                     Previsão: <br /> 🚌 <b>{v.linha}</b> — {v.horario}
-                    {v.minutos !== null && v.minutos !== undefined
+                    {v.minutos === null && v.minutos !== undefined
                       ? ` (${v.minutos} min)`
                       : ""}
killedBy: MapView carrega e exibe previsoes normalizadas pelo backend ao clicar na parada
statusReason: Unable to find an element with the text: /10 min/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >
