[Killed] ConditionalExpression
src/services/normalizarPrevisao.js:26:7
     return linha.descricao;
   }
 
-  if (linha?.lt0 && linha?.lt1) {
+  if (false) {
     return `${linha.lt0} ⇄ ${linha.lt1}`;
   }
killedBy: normalizarPrevisoes normaliza o formato bruto da SPTrans com p.l
statusReason: expected [ { placa: 'BUS-1', …(7) } ] to deeply equal [ { placa: 'BUS-1', …(7) } ]

[Killed] ConditionalExpression
src/services/normalizarPrevisao.js:26:7
     return linha.descricao;
   }
 
-  if (linha?.lt0 && linha?.lt1) {
+  if (true) {
     return `${linha.lt0} ⇄ ${linha.lt1}`;
   }
killedBy: normalizarPrevisoes aceita payload com l e array direto
statusReason: expected [ { placa: 'BUS-3', …(7) } ] to deeply equal [ { placa: 'BUS-3', …(7) } ]

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:35:12
 
 function normalizeVeiculo(veiculo, linha) {
   return {
-    placa: veiculo?.placa ?? veiculo?.p ?? null,
+    placa: (veiculo?.placa ?? veiculo?.p) && null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
killedBy: normalizarPrevisoes normaliza o formato bruto da SPTrans com p.l
statusReason: expected [ { placa: null, …(7) } ] to deeply equal [ { placa: 'BUS-1', …(7) } ]

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:35:12
 
 function normalizeVeiculo(veiculo, linha) {
   return {
-    placa: veiculo?.placa ?? veiculo?.p ?? null,
+    placa: veiculo?.placa && veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
killedBy: normalizarPrevisoes normaliza o formato bruto da SPTrans com p.l
statusReason: expected [ { placa: null, …(7) } ] to deeply equal [ { placa: 'BUS-1', …(7) } ]

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:36:14
 function normalizeVeiculo(veiculo, linha) {
   return {
     placa: veiculo?.placa ?? veiculo?.p ?? null,
-    horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
+    horario: (veiculo?.horaPrevista ?? veiculo?.horario) && veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
killedBy: MapView carrega e exibe previsoes normalizadas pelo backend ao clicar na parada
statusReason: Unable to find an element with the text: /12:10/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:36:14
 function normalizeVeiculo(veiculo, linha) {
   return {
     placa: veiculo?.placa ?? veiculo?.p ?? null,
-    horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
+    horario: (veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t) && null,
     minutos: veiculo?.minutos ?? null,
     ativo: veiculo?.ativo ?? veiculo?.a ?? null,
killedBy: MapView carrega e exibe previsoes normalizadas pelo backend ao clicar na parada
statusReason: Unable to find an element with the text: /12:10/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:38:12
     placa: veiculo?.placa ?? veiculo?.p ?? null,
     horario: veiculo?.horaPrevista ?? veiculo?.horario ?? veiculo?.t ?? null,
     minutos: veiculo?.minutos ?? null,
-    ativo: veiculo?.ativo ?? veiculo?.a ?? null,
+    ativo: veiculo?.ativo && veiculo?.a ?? null,
     py: veiculo?.py ?? null,
     px: veiculo?.px ?? null,
killedBy: normalizarPrevisoes normaliza o formato bruto da SPTrans com p.l
statusReason: expected [ { placa: 'BUS-1', …(7) } ] to deeply equal [ { placa: 'BUS-1', …(7) } ]

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:48:22
 
 export function normalizarPrevisoes(payload) {
   return getLinhas(payload).flatMap((linha) => {
-    const veiculos = linha?.veiculos ?? linha?.vs ?? [];
+    const veiculos = (linha?.veiculos ?? linha?.vs) && [];
 
     if (!Array.isArray(veiculos)) {
killedBy: MapView carrega e exibe previsoes normalizadas pelo backend ao clicar na parada
statusReason: Unable to find an element with the text: 101. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >

[Killed] LogicalOperator
src/services/normalizarPrevisao.js:48:22
 
 export function normalizarPrevisoes(payload) {
   return getLinhas(payload).flatMap((linha) => {
-    const veiculos = linha?.veiculos ?? linha?.vs ?? [];
+    const veiculos = linha?.veiculos && linha?.vs ?? [];
 
     if (!Array.isArray(veiculos)) {
killedBy: MapView carrega e exibe previsoes normalizadas pelo backend ao clicar na parada
statusReason: Unable to find an element with the text: 101. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="map-container"
    >
