[Killed] ConditionalExpression
src/services/sptransAPI.js:3:18
 import axios from "axios";
 
-const API_BASE = import.meta.env.VITE_API_URL || "http://localhost:3000/api";
+const API_BASE = true;
 
 const api = axios.create({
killedBy: sptransAPI usa VITE_API_URL com fallback para localhost
statusReason: expected true to be 'http://localhost:3000/api' // Object.is equality
